window.localMandatory = [
  {
    teacher: 'Маша',
    halls: [1],
    daysOfWeek: ['пн', 'ср', 'пт'],
    times: ['10:00', '10:30', '11:00', '17:00', '17:30', '18:00', '18:30', '19:00', '19:30', '20:00', '20:30', '21:00']
  },
  {
    teacher: 'Лиля',
    halls: [1],
    daysOfWeek: ['вт', 'чт'],
    times: ['18:30', '19:00', '19:30', '20:00', '20:30', '21:00']
  },
  {
    teacher: 'Настя',
    halls: [1],
    daysOfWeek: ['вт', 'чт'],
    times: ['17:30', '18:00']
  },
  {
    teacher: 'Влад',
    halls: [1],
    daysOfWeek: ['сб'],
    times: ['12:00', '12:30', '13:00', '13:30', '14:00', '14:30', '15:00', '15:30', '16:00', '16:30', '17:00', '17:30', '18:00']
  },
  {
    teacher: 'Катя',
    halls: [2],
    daysOfWeek: ['вт', 'чт'],
    times: ['18:30', '19:00', '19:30', '20:00', '20:30', '21:00']
  },
  {
    teacher: 'Руди',
    halls: [2],
    daysOfWeek: ['пн', 'ср', 'пт'],
    times: ['19:30', '20:00', '20:30', '21:00']
  },
  {
    teacher: 'Лиза',
    halls: [2],
    daysOfWeek: ['пн', 'ср'],
    times: ['17:30', '18:00', '18:30', '19:00']
  },
  {
    teacher: 'Свободное время',
    halls: [1],
    daysOfWeek: ['пн', 'ср', 'пт'],
    times: ['14:00', '14:30', '15:00', '15:30', '16:00', '16:30']
  },
  {
    teacher: 'Свободное время',
    halls: [2],
    daysOfWeek: ['вт', 'чт'],
    times: ['14:00', '14:30', '15:00', '15:30', '16:00', '16:30']
  },
  {
    teacher: 'Закрыто',
    halls: [1, 2],
    daysOfWeek: ['сб'],
    times: ['21:00', '21:30']
  },
  {
    teacher: 'Закрыто',
    halls: [1, 2],
    daysOfWeek: ['вс'],
    times: ['17:30', '18:00', '18:30', '19:00', '19:30', '20:00', '20:30', '21:00']
  }
];


